Enterprise_Serivces/Cert/SilverGroup1/CSLAllSparkCatalogService/result1/Iteration1/t5_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">3408e959-5454-4a39-bbc6-ba0d62f3d82e</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkCatalog/V1.0/DigitalCatalogService_v1/GetPartnerCatalog</wsa:Action><wsa:MessageID>uuid:ba3dbefd-1bd1-45ad-a4c7-9f8c7787d48d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkcatalogserviceqa1.testgs.pvt/DigitalCatalogService.svc</wsa:To></soap:Header><soap:Body><GetPartnerCatalogRequest xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0"><PageNumber>1</PageNumber><PageSize>1</PageSize><PartnerKey>TEST-US</PartnerKey></GetPartnerCatalogRequest></soap:Body></soap:Envelope>